app/controllers/students_controller.rb

    def create
        @student = Student.new(first_name:params[:student][:first_name],last_name:params[:student][:last_name])
        @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-04-03 01:34:28.915433"], ["updated_at", "2019-04-03 01:34:28.915433"]]

    def update
        @student = Student.find(params[:id])
        Student.update(first_name:params[:student][:first_name],last_name:params[:student][:last_name])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-04-03 01:23:41.432614"], ["id", 1]]